# **01- How to find the version?**

In [25]:
import pandas as pd
pd.__version__

'1.4.4'

In [26]:
# Another way to see the version
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : ca60aab7340d9989d9428e11a51467658190bb6b
python           : 3.10.7.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22623
machine          : AMD64
processor        : Intel64 Family 6 Model 142 Stepping 11, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.4.4
numpy            : 1.23.2
pytz             : 2022.2.1
dateutil         : 2.8.2
setuptools       : 63.2.0
pip              : 22.2.2
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : 4.9.1
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.4.0
pandas_datareader: None
bs4              : 4.11.1
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
markupsafe       : 2.1.1
matplotlib       : 3.5.3
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.0.10
pandas_gbq       : None
pyarrow          : 9.0.0
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.9.1
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : 0.9.0
xarray           : 2022.10.0
xlrd             : None
xlwt             : None
zstandard        : None

# **02- Make a dataframe**

In [27]:
pd.DataFrame({'A column': [1, 2, 3], 'B column': [4, 5, 6], 'C column': [7, 8, 9]})

   A column  B column  C column
0         1         4         7
1         2         5         8
2         3         6         9

In [28]:
# To store the dataframe in a variable, lenght must be same for all columns
df = pd.DataFrame({'A column': [1, 2, 3], 'B column': [4, 5, 6], 'C column': [7, 8, 9]})
df.head()

   A column  B column  C column
0         1         4         7
1         2         5         8
2         3         6         9

In [29]:
# TO save the dataframe to a csv file
df.to_csv('df.csv')

In [30]:
# Numpy array use to create a dataframe
import numpy as np
arr = np.array([[1, 2, 3,4,5,6,7], [4, 5, 6,7,8,9,10], [20,10,5, 4, 5, 6,7]])
arr

array([[ 1,  2,  3,  4,  5,  6,  7],
       [ 4,  5,  6,  7,  8,  9, 10],
       [20, 10,  5,  4,  5,  6,  7]])

In [31]:
# Convert array into dataframe
pd.DataFrame(arr)

    0   1  2  3  4  5   6
0   1   2  3  4  5  6   7
1   4   5  6  7  8  9  10
2  20  10  5  4  5  6   7

In [32]:
# Numpy array use to create a dataframe
pd.DataFrame(np.random.rand(4, 8))

,0,1,2,3,4,5,6,7
0,0.281124,0.305890,0.090569,0.848709,0.367534,0.875663,0.824046,0.898672
1,0.301469,0.714043,0.807162,0.000618,0.528276,0.672933,0.031890,0.417293
2,0.679655,0.386891,0.911260,0.752729,0.421829,0.282845,0.377174,0.113582
3,0.954018,0.449426,0.044306,0.467691,0.298318,0.567485,0.402173,0.295882

In [33]:
# To give the name of columns in the above generated dataframe
pd.DataFrame(np.random.rand(4, 8), columns=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'])

,A,B,C,D,E,F,G,H
0,0.159447,0.753156,0.534149,0.751298,0.747182,0.632818,0.564191,0.358113
1,0.333823,0.323243,0.967866,0.761435,0.617204,0.637864,0.191056,0.482137
2,0.149273,0.555828,0.787815,0.631400,0.704353,0.284614,0.267190,0.029075
3,0.699512,0.611107,0.272135,0.361673,0.909656,0.060159,0.843427,0.940424

# **03 How to rename columns**

In [34]:
# Create dataframe from dictionary
df = pd.DataFrame({'Col':[1,2,3,4,5,6,7,8,9,10], 'Col2':[11,12,13,14,15,16,17,18,19,20]})
df.head()

   Col  Col2
0    1    11
1    2    12
2    3    13
3    4    14
4    5    15

In [35]:
# Rename columns (Method 1)
df.rename(columns={'Col':'Column1', 'Col2':'Column2'}, inplace=True)
df.head()

   Column1  Column2
0        1       11
1        2       12
2        3       13
3        4       14
4        5       15

In [36]:
# Rename columns (Method 2)
df.columns=['Column_A', 'Column_B']
df.head()

   Column_A  Column_B
0         1        11
1         2        12
2         3        13
3         4        14
4         5        15

In [37]:
# To replace any character, string, _ is removed from the column name
df.columns=df.columns.str.replace('_', ' ')
df.head()

   Column A  Column B
0         1        11
1         2        12
2         3        13
3         4        14
4         5        15

In [38]:
# To add _ in the datafreame column name
df.columns=df.columns.str.replace(' ', '_')
df.head()

   Column_A  Column_B
0         1        11
1         2        12
2         3        13
3         4        14
4         5        15

In [39]:
# Adding prefix to columns
df = df.add_prefix('Aadi_')
df.head()

   Aadi_Column_A  Aadi_Column_B
0              1             11
1              2             12
2              3             13
3              4             14
4              5             15

In [40]:
# Adding suffix to columns
df = df.add_suffix('_Aadi')
df.head()

   Aadi_Column_A_Aadi  Aadi_Column_B_Aadi
0                   1                  11
1                   2                  12
2                   3                  13
3                   4                  14
4                   5                  15

In [41]:
df.columns = ['col_A', 'col_B']
df

   col_A  col_B
0      1     11
1      2     12
2      3     13
3      4     14
4      5     15
5      6     16
6      7     17
7      8     18
8      9     19
9     10     20

# **04 Using template data**

In [42]:
import pandas as pd
import numpy as np
import seaborn as sns

kashti = sns.load_dataset('titanic')
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [43]:
# Renmae the columns
kashti.rename(columns={'age': 'Age', 'sex': 'Sex'}, inplace=True)
kashti.head()

,survived,pclass,Sex,Age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [44]:
# Data info
kashti.describe()

         survived      pclass         Age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [45]:
kashti.columns

Index(['survived', 'pclass', 'Sex', 'Age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [46]:
# Saving a dataset
kashti.to_csv('kashti.csv')
#pip install openpyxl
kashti.to_excel('kashti.xlsx')

PermissionError: [Errno 13] Permission denied: 'kashti.xlsx'

# **05 - Using your own data**

In [ ]:
import pandas as pd
df = pd.read_csv('kashti.csv')
df.head()

,Unnamed: 0,survived,pclass,Sex,Age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [47]:
# Read Excell File
df1 = pd.read_excel('kashti.xlsx')
df1.head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# **06 - Reverse Row Order**

In [48]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [49]:
# reverse the order of the rows
df.loc[::-1].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [50]:
# Reset the index
df.loc[::-1].reset_index(drop=True).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

# **07 - Reverse Column order**

In [51]:
df.loc[: , ::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

# **08 - Select a column by dtype**

In [52]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [53]:
# Only select those have numeric type
df.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [54]:
# only select those have object type
df.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [55]:
# Only select those have multiple types
df.select_dtypes(include=['number', 'object']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,man,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,woman,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,woman,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,woman,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,man,Southampton,no

In [56]:
# Use exclude to remove the unwanted columns
df.select_dtypes(exclude=['number']).head()

      sex embarked  class    who  adult_male deck  embark_town alive  alone
0    male        S  Third    man        True  NaN  Southampton    no  False
1  female        C  First  woman       False    C    Cherbourg   yes  False
2  female        S  Third  woman       False  NaN  Southampton   yes   True
3  female        S  First  woman       False    C  Southampton   yes  False
4    male        S  Third    man        True  NaN  Southampton    no   True

In [57]:
# Use exclude to remove the unwanted columns
df.select_dtypes(exclude=['object']).head()

,survived,pclass,age,sibsp,parch,fare,class,adult_male,deck,alone
0,0,3,22.0,1,0,7.2500,Third,True,NaN,False
1,1,1,38.0,1,0,71.2833,First,False,C,False
2,1,3,26.0,0,0,7.9250,Third,False,NaN,True
3,1,1,35.0,1,0,53.1000,First,False,C,False
4,0,3,35.0,0,0,8.0500,Third,True,NaN,True

# **09 - Convert strings to number**

In [58]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 'B': [11, 12, 13, 14, 15, 16, 17, 18, 19, 20]})
df.head()

   A   B
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [59]:
df.dtypes

A    int64
B    int64
dtype: object

In [60]:
df = pd.DataFrame({'A': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'], 'B': ['11', '12', '13', '14', '15', '16', '17', '18', '19', '20']})
df.dtypes

A    object
B    object
dtype: object

In [61]:
# Convert string object into integer
df.astype({'A': 'float64', 'B': 'int64'}).dtypes

A    float64
B      int64
dtype: object

# **10 - Reduce dataframe size**

In [62]:
df = sns.load_dataset('titanic')
df.shape

(891, 15)

In [63]:
# take some fraction of dataset like sample
df.sample(frac=0.1).shape  # 10% of the dataset

(89, 15)

# **11 - Copy data from clip board**

In [64]:
# Dataset dowlnoad from the internet
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.to_excel('kashti.xlsx')

PermissionError: [Errno 13] Permission denied: 'kashti.xlsx'

In [65]:
# Read clipboard in python
df = pd.read_clipboard()
df
# To save this clipboard data into a csv file
df.to_csv('clipboard.csv')

EmptyDataError: No columns to parse from file

# **12 - Split datasets into two subsets**

In [66]:
# Dataframe download
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [67]:
len(df)

891

In [68]:
df.shape

(891, 15)

In [69]:
from random import random
kashti_1 = df.sample(frac=0.50, random_state=1)
kashti_1.shape

(446, 15)

In [70]:
kashti_2 = df.drop(kashti_1.index)
kashti_2.shape

(445, 15)

In [71]:
kashti_1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [72]:
kashti_2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [73]:
len(kashti_1) + len(kashti_2)

891

# **13 - Join two split datasets together**

In [74]:
# Appened again to make the original dataset
df1 = kashti_1.append(kashti_2)
df1.shape

C:\Users\MUHAMMAD ADNAN\AppData\Local\Temp\ipykernel_17616\1670357066.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = kashti_1.append(kashti_2)

(891, 15)

# **14 - Filtering a dataset**

In [75]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [76]:
# Find unique values in a column
df['sex'].unique()

array(['male', 'female'], dtype=object)

In [77]:
df['age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [78]:
# Take only female or male dataset
df[(df.sex=='female')].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [85]:
df[(df.embark_town=='Cherbourg')].shape

(168, 15)

In [88]:
# Just take data from the specific gender and embarked town
df[(df.embark_town=='Southampton') &
   (df.sex=='female')].shape

(203, 15)

In [93]:
df[((df.embark_town=='Southampton') |
    (df.embark_town=='Queenstown')) &
    (df.sex=='male')].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False

In [94]:
# Take the data only one town out of three. 
df[df.embark_town.isin(['Queenstown'])].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
32,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True

In [98]:
# Take the age greater than 20 years
df[df.age > 20].shape

(535, 15)

# **15 - Filtering by large categories**

In [100]:
df.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [101]:
df.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [105]:
# Largest value in a column (MOST FREQUENT) (Method 1)
df.age.value_counts().nlargest(5)

24.0    30
22.0    27
18.0    26
19.0    25
28.0    25
Name: age, dtype: int64

In [106]:
df.age.value_counts().nlargest(5).index

Float64Index([24.0, 22.0, 18.0, 19.0, 28.0], dtype='float64')

In [107]:
# Largest value in a column (MOST FREQUENT) (Method 2)
counts = df.age.value_counts()
counts.nlargest(3)

24.0    30
22.0    27
18.0    26
Name: age, dtype: int64

In [113]:
# Largest value in a column (MOST FREQUENT) (Method 2)
counts = df.embark_town.value_counts()
counts.nlargest(3).index

Index(['Southampton', 'Cherbourg', 'Queenstown'], dtype='object')

In [115]:
counts = df.who.value_counts()
counts.nlargest(3)

man      537
woman    271
child     83
Name: who, dtype: int64

In [117]:
df[df.who.isin(counts.nlargest(1).index)].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True